{"Mens_Underwear_brands":[{"GroupName":"U","GroupID":"Brands_U","Brands":[{"Name":"UFM Underwear for Men","id":"UFM-Underwear-for-Men","Website":"https://www.ufmunderwear.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_7e58559f9d814160b717b7500a4fe615~mv2.jpg","MensUnderwearUrl":"https://www.ufmunderwear.com/mens-boxer-briefs.html","AboutUrl":"https://www.ufmunderwear.com/contacts","description":"UFM Underwear for Men is a premium brand of men's underwear featuring our exclusive US patented and Intl patents pending drawstring support system. UFM's underwear provide cool and comfortable support for sports, work, medical and everyday wear."},{"Name":"UGG","id":"UGG","Website":"https://www.ugg.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_c92e33b5ebae466c972d538581bdf7b7~mv2.png","MensUnderwearUrl":"https://www.ugg.com/men-sleepwear-robes","AboutUrl":"https://www.ugg.com/our-story.html","description":"It started in 1978, when Australian surfer Brian Smith moved to Southern California with a dream. Designing a product unlike any other from his favorite material – sheepskin – the Classic Boot was born. By the mid 80s, UGG became a symbol of SoCal beach culture, gaining momentum through surf shops from San Diego to Santa Cruz. Adopted by the fashion elite and then the world, the brand has since expanded beyond the icon to design footwear, apparel, accessories, and homeware with an uncompromising attitude toward creativity, quality, and craftsmanship."},{"Name":"Undergear","id":"Undergear","Website":"https://www.undergear.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_b2037c14f9d44510a050efa60e4bc800~mv2.png","MensUnderwearUrl":"https://www.undergear.com/collections","AboutUrl":"https://www.undergear.com/pages/about-us","description":"Undergear offers the widest and most stylish assortment of men’s underwear. But that’s just the beginning. Our trend-conscious collections make sure that you’re always looking and feeling your best—for the work week, the weekend and beyond."},{"Name":"Underjeans","id":"Underjeans","Website":"https://underjeansbrand.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_28dee9219453450ab0b6e0bf79053d83~mv2.jpg","MensUnderwearUrl":"https://underjeansbrand.com/collections/underwear","AboutUrl":"https://underjeansbrand.com/pages/about","description":"Founded in 2009 as a resolve to the question; where can a fashion conscious man of any persuasion find style, fit & comfort to accommodate his Junk without having to resort to something that only comes in a 3-pack or is tight & white. It is no longer a secret that Victoria answered the needs of women...but men have their needs for fashion under apparel as well. Junk Underjeans was conceived to address the needs of the fashion conscious male by offering seasonal innovative fashion product that not only looks great on but is extremely comfortable as well. Both having diverse backgrounds in fashion apparel,the two partners Louise Lai & Sean Gregg believed that if the fashion didn’t exist in the market that they’d take on the challenge themselves and Junk Underjeans was created. "},{"Name":"Uniqlo","id":"Uniqlo","Website":"https://www.uniqlo.com","LogoUrl":"https://static.wixstatic.com/shapes/dcf82b_e7cb32545ecb426cb75fab52a685ab3d.svg","MensUnderwearUrl":"https://www.uniqlo.com/us/en/men/shorts","AboutUrl":"https://www.uniqlo.com/lifewear/us/en","description":"For affordable basics, Japanese brand Uniqlo is always a solid go-to option. The retailer’s underwear and socks have gained a reputation for being some of the best on the high street and unbeatable in terms of value for money. They may not have a branded waistband, but you can expect high-quality Supima cotton construction and a wealth of colours and patterns at prices that allow you to regularly restock your rotation."}]},{"GroupName":"V","GroupID":"Brands_V","Brands":[{"Name":"Versace","id":"Versace","Website":"https://www.versace.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_75a532a2b8fc494b9ca05e169480512f~mv2.png","MensUnderwearUrl":"https://www.versace.com/us/en-us/men/clothing/underwear-socks","AboutUrl":"https://www.versace.com/us/en-us/about-us/company-profile.html","description":"Founded in 1978 in Milan, Gianni Versace S.r.l. is one of the leading international fashion design houses and a symbol of Italian luxury world-wide. It designs, manufactures, distributes and retails fashion and lifestyle products including haute couture, prèt-à-porter, accessories, jewellery, watches, eyewear, fragrances, and home furnishings all bearing the distinctive Medusa logo."}]},{"GroupName":"Z","GroupID":"Brands_Z","Brands":[{"Name":"Zimmerli","id":"Zimmerli","Website":"https://www.zimmerli.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_77ad3618c3db4d8d8500b791e7ed2300~mv2.png","MensUnderwearUrl":"https://www.zimmerli.com/us_en/gents/underwear.html","AboutUrl":"https://www.zimmerli.com/us_en/newsfeed","description":"150 years ago, inventor and mother of seven Pauline Zimmerli founded the company of the same name. Today, strong women continue to shape Zimmerli – such as Laetitia Wollschlegel, Head of Product Management."}]}]}