{"Mens_Underwear_brands":[{"GroupName":"D","GroupID":"Brands_D","Brands":[{"Name":"Daniel Alexander","id":"Daniel-Alexander","Website":"https://www.danielalexanderunderwear.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_1bc9493bdf3046439ce9d360feef60b3~mv2.jpg","MensUnderwearUrl":"https://www.danielalexanderunderwear.com/collections/bestsellers","AboutUrl":"https://www.danielalexanderunderwear.com/pages/about-us","description":"Daniel Alexander is a cutting edge brand for men that allows them to feel comfortable in their own skin.  Daniel Alexander is sexy, but we do not sell sex.  We sell a feeling. When you wear Daniel Alexander products under your clothes - you are empowered.  No one may find out what you have under, but you know what you have on and that is an amazing feeling.  If you cannot relate to this, you have not worn Daniel Alexander."},{"Name":"Dearfoams","id":"Dearfoams","Website":"https://www.amazon.com/stores/Dearfoams/page/F99B387E-2B5F-4D65-B0C1-A132F8ED794B?ref_=ast_bln&tag=aonga-20","LogoUrl":"https://static.wixstatic.com/media/dcf82b_fcfdad49ef3047e3983a173729171f9b~mv2.jpg","MensUnderwearUrl":"https://www.amazon.com/stores/page/3C81C55C-F25F-4F88-82FC-C6C85BF32552?ingress=2&tag=aonga-20&visitId=46dc5d7e-d30a-4485-81fa-a6773983a44c&ref_=ast_bln","AboutUrl":"https://www.amazon.com/stores/page/F99B387E-2B5F-4D65-B0C1-A132F8ED794B?ingress=2&tag=aonga-20&visitId=46dc5d7e-d30a-4485-81fa-a6773983a44c&ref_=ast_bln","description":"Dearfoams slippers have well earned their reputation as a revered legacy brand, having supplied Americans and those abroad with comfortable, cozy comfort footwear that is affordable and makes the prospect of hearth and home even more enjoyable. Men's Dearfoams lounge footwear at HisRoom includes suede-look microfiber moccasins, microsuede clogs, quilted clogs, corduroy styles and more manly styles, many with faux shearling linings for warmth and memory foam insoles that conform to your feet's contours via body heat."},{"Name":"Derek Rose","id":"Derek-Rose","Website":"https://www.derek-rose.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_2e813179bbeb4dd690bd8775e29d6506~mv2.png","MensUnderwearUrl":"https://www.derek-rose.com/us/men/clothing/mens-underwear.html","AboutUrl":"https://www.derek-rose.com/us/about-us","description":"The Rose family first entered the design and manufacture of men’s clothing when Jack Lewis Rose started out in 1926."},{"Name":"Diesel","id":"Diesel","Website":"https://global.diesel.com/home","LogoUrl":"https://static.wixstatic.com/shapes/dcf82b_72d18e32305b49a99e28672253f8ba6f.svg","MensUnderwearUrl":"https://global.diesel.com/man/underwear","AboutUrl":"https://www.otb.net/en/otb-career","description":"Diesel’s often colorful designs are made from a stretch-jersey fabric for a smooth finish and breathability. This brand carries fun and youthful edge throughout their line that is sure to pick up your mood on a rainy day – even if you’re the only one who knows you’re wearing them. They also have a knack for experimenting with different textures and materials, like sewn-on patches and even metal studs."},{"Name":"Dolce & Gabbana","id":"Dolce-Gabbana","Website":"https://us.dolcegabbana.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_8763375752b841b68a15139125f0f32f~mv2.png","MensUnderwearUrl":"https://us.dolcegabbana.com/en/men/clothing/underwear","AboutUrl":"https://world.dolcegabbana.com/corporate","description":"Dolce & Gabbana’s range is defined by well-made streamline bottoms in your basic black, white and grey. The Italian luxury brand offers a small line of briefs and boxer briefs made from high-quality cotton. The signature logo waistband prevents your underwear from breaking out of place while the fitted design and short leg promotes freedom of movement."},{"Name":"DUKE ATHLETIC-TACTICAL","id":"DUKE-ATHLETIC-TACTICAL","Website":"https://www.dukeathletic-tactical.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_57e848c1489a4458bd3ef749b569fc45~mv2.png","MensUnderwearUrl":"https://www.dukeathletic-tactical.com/list/boxersbriefsshorts","AboutUrl":"https://www.dukeathletic-tactical.com/pages/about-duke-athletic-tactical--","description":"For 40 years, DUKE ATHLETIC-TACTICAL has been outfitting the US military and professional athletes around the world with affordable, comfortable, high performance workout gear. We now bring this same uncompromising commitment to quality, comfort, easy care and cost-effectiveness directly to you, our online customers."},{"Name":"Duluth Trading","id":"Duluth-Trading","Website":"https://www.duluthtrading.com","LogoUrl":"https://static.wixstatic.com/shapes/dcf82b_92d62428d74542bf9caea88557992577.svg","MensUnderwearUrl":"https://www.duluthtrading.com/men/underwear","AboutUrl":"https://www.duluthtrading.com/our-story.html","description":"ow a household name, Duluth Trading burst on the scene just 30 years ago in Duluth, MN. It’s a colorful story of crazy characters, innovation and hardworking men and women. Learn how we got here, where we’re headed and what it all means to you."}]},{"GroupName":"E","GroupID":"Brands_E","Brands":[{"Name":"Emporio Armani","id":"Emporio-Armani","Website":"https://www.armani.com","LogoUrl":"https://static.wixstatic.com/shapes/dcf82b_e946d2f756a2487a953c2058cddbd556.svg","MensUnderwearUrl":"https://www.armani.com/us/armanicom/emporio-armani/men/underwear","AboutUrl":"http://careers.giorgioarmani.com","description":"Underwear by Emporio Armani has long been synonymous with luxury and sex-appeal. Endorsed by the likes of David Beckham and Christiano Ronaldo, Armani’s high-end designs are made of soft fabrics such as cotton, microfibre, Pima cotton or modal. "},{"Name":"Entireworld","id":"Entireworld","Website":"https://theentireworld.com","LogoUrl":"https://static.wixstatic.com/shapes/dcf82b_74f5884ec3c442bfadfaf0bfa0e949ce.svg","MensUnderwearUrl":"https://theentireworld.com/men/underwear","AboutUrl":"https://theentireworld.com","description":"The makers of those sweatsuits that everybody's talking about also turn out some high-quality organic cotton undies. The makers of those sweatsuits that everybody's talking about also turn out some high-quality organic cotton undies."},{"Name":"Ergowear","id":"Ergowear","Website":"https://www.ergowear.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_3c7e2b58e5d64e51b2d1029884be0f26~mv2.png","MensUnderwearUrl":"https://www.ergowear.com/underwear","AboutUrl":"https://www.ergowear.com/about-us","description":"The official Ergowear store – the original source for men's ergonomic underwear and swimwear since 2002. Yes – we've been around for a while so we know a thing or two about men's underwear needs. And what's “ergonomic”? Essentially it means our designes are actually adapted to men's shapes and dimensions (and not the other way around!)."},{"Name":"Ermenegildo Zegna","id":"Ermenegildo-Zegna","Website":"https://www.zegna.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_6a95f97f51d64595aa6aa3a4fe519eb5~mv2.png","MensUnderwearUrl":"https://www.zegna.com/us-en/ready-to-wear/underwear-socks","AboutUrl":"https://www.zegna.com/us-en/group-story","description":"Ermenegildo Zegna started his company in the Northern Italian town of Trivero in 1910 with the dream of creating the most beautiful fabrics in the world. It has since grown into one of Italy’s best-known dynamic family businesses. The company is now led by the third generation with Gildo as CEO, Paolo as Chairman, and Anna as President of Fondazione Zegna. Today, the fourth generation has entered the company and continues to innovate.  "},{"Name":"ES Collection","id":"ES-Collection","Website":"https://escollection.es","LogoUrl":"https://static.wixstatic.com/media/dcf82b_1f6cb9a5234043729fcf332ce4382c40~mv2.png","MensUnderwearUrl":"https://escollection.es/en/126-underwear","AboutUrl":"https://escollection.es/en/content/4-about-us","description":"ES Collection was founded in 2006 in Barcelona, dedicating itself to the design, manufacturing and sale of men’s swimwear"},{"Name":"Everlane","id":"Everlane","Website":"https://www.everlane.com/","LogoUrl":"https://static.wixstatic.com/media/dcf82b_58ba69b560134c008ef653ea80c3dbd7~mv2.jpg","MensUnderwearUrl":"https://www.everlane.com/collections/mens-underwear","AboutUrl":"https://www.instagram.com/everlane","description":"You know a company really stand by their underwear offerings when they offer a 365-day guarantee. Everlane's Supima cotton boxer brief is both durable and incredibly soft, meaning this purchase will save you from having to even think about underwear shopping for a long, long time—miracles do happen after all. "},{"Name":"ExOfficio","id":"ExOfficio","Website":"https://www.exofficio.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_7e2e12a778c34011bdd66cf71981a6cc~mv2.png","MensUnderwearUrl":"https://www.exofficio.com/men/underwear","AboutUrl":"https://www.exofficio.com/about-us.html","description":"ExOfficio believes in the magic of travel. Whether you seek different cultures, epic scenery, or the thrill of the unknown, it's a chance to create perspective and vitality by opening your mind to the wonders of the world."}]},{"GroupName":"F","GroupID":"Brands_F","Brands":[{"Name":"Falke","id":"Falke","Website":"https://www.falke.com","LogoUrl":"https://static.wixstatic.com/shapes/dcf82b_3987ff782ee74fc8aa9cd9f61e910359.svg","MensUnderwearUrl":"https://www.falke.com/ro_en/men/sports/functional-underwear","AboutUrl":"https://www.falke.com/ro_en/company/about-us","description":"The FALKE functional underwear for men is optimally tailored to your needs and offers maximum comfort during exercise. The blend of innovative materials ensures perfect moisture and temperature regulation. Maximum freedom of movement is guaranteed thanks to specially incorporated functional zones. The short and long-sleeved shirts, boxers, briefs and trousers protect against overheating and cooling of the body in summer, as well as winter and have an odour neutralising effect. Flat seams or seamless processing prevent pressure or chafing. They will meet your diverse requirements for all indoor and outdoor activities such as in the gym, while running, hiking or skiing. The lines are perfectly aligned to different outside temperatures and activity levels. Maximum warmth - for very cold outside temperatures, Warm - for mild to cold outside temperatures, Cool - for warm to hot temperatures, Wool Tech Light - Combination of the finest merino wool and functional materials for warm and cold outdoor temperatures,  Wool-Tech - natural fibres for cold to very cold outside temperatures, Silk-Wool - natural fibres for warm to cold outside temperatures."},{"Name":"Frigo","id":"Frigo","Website":"https://www.amazon.com/stores/FRIGO/FRIGO/page/0E47A3DE-0DC0-4E8E-ACAD-9178671A15B1&tag=aonga-20","LogoUrl":"https://static.wixstatic.com/media/dcf82b_0a5a78638fc940d6abdd5c132f183d75~mv2.jpg","MensUnderwearUrl":"https://www.amazon.com/stores/page/CAA7B9FE-003C-4992-A05D-9978067956D9?ingress=0&visitId=e2dc2f86-af59-484c-b8fc-bd114a7e9e16&tag=aonga-20","AboutUrl":"https://www.amazon.com/stores/FRIGO/FRIGO/page/0E47A3DE-0DC0-4E8E-ACAD-9178671A15B1&tag=aonga-20","description":"Frigo men's Underwear black tencel Boxer brief. For an active lifestyle with lots of movement, these will keep you cool and comfortable Frigo Zone Technology with Soft layered mesh structure"},{"Name":"Fruit of the Loom","id":"Fruit-of-the-Loom","Website":"https://www.fruit.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_cf1b843083cb43bf8540b23f79f17833~mv2.png","MensUnderwearUrl":"https://www.fruit.com/men/underwear","AboutUrl":"https://www.fruit.com/fruit-story","description":"Fruit of the Loom was born in 1851 when brothers Benjamin and Robert Knight bought their first mill and started producing cotton cloth and textiles in Warwick, Rhode Island. In 1871, Fruit of the Loom® was registered as an official trademark, making it one of the world’s oldest brands — predating the invention of light bulbs, cars and telephones! Today, more than 160 years later, Fruit of the Loom is now a global underwear and casualwear business, employing more than 28,000 people worldwide. Our colorful T-shirts and underwear are known by consumers in all corners of the globe and our name is synonymous with providing quality, value and style. Staying true to our roots and close to our heritage, our collections are authentic, timeless and unmistakably Fruit of the Loom."}]}]}