{"Mens_Underwear_brands":[{"GroupName":"M","GroupID":"Brands_M","Brands":[{"Name":"Mack Weldon","id":"Mack-Weldon","Website":"https://mackweldon.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_a587b66296674f908a994ed5c519c032~mv2.png","MensUnderwearUrl":"https://mackweldon.com/collections/underwear","AboutUrl":"https://mackweldon.com/pages/our-story","description":"We founded Mack Weldon because we wanted more out of our basics and always questioned how something so essential could be such a pain to buy. Surrounded by a mind-numbing assortment of underwear and socks in the department store, we realized consistent fit and quality became a game of roulette. So we decided to take matters into our own hands."},{"Name":"Malebasics","id":"Malebasics","Website":"https://malebasics.com","LogoUrl":"https://static.wixstatic.com/shapes/dcf82b_537d727a391c475c9dcbf4a33553644c.svg","MensUnderwearUrl":"https://malebasics.com/mens-underwear","AboutUrl":"https://malebasics.com/about","description":"Malebasics.com was founded in 2003 out of a need to provide men the perfect outlet for purchasing the types of underwear they prefer. From sportswear, to thongs, to sexy briefs and swimwear; we wanted every choice a man could want under one site. Malebasics.com became a reality and we've been satisfying our clients underwear needs ever since. We offer a complete line of swimwear, sportswear and intimate apparel, for every man. After all, it's not just the ladies that want to look good in their underwear. We at Malebasics.com, understand that men want to look sexy and confident in their underwear, and by offering a solid selection, we ensure that they can do just that. From the comfortable boxer-briefs, to the form hugging thong or g-string; men have an array of choices to dress for any occasion."},{"Name":"Male Power","id":"Male-Power","Website":"https://www.malepower.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_8c63fa6e8f8647c79b62d852968d00bd~mv2.png","MensUnderwearUrl":"https://www.malepower.com/shop","AboutUrl":"https://www.malepower.com/about-us","description":"Male Power pioneered the concept of “male lingerie,” a label coined by our visionary founder, Sam Baker. During the mid-1970s, when our company first opened for business, his ideas were original and audacious. He embraced lifestyles that had yet to gain full acceptance, and identified a seemingly simple but rarely acknowledged truth – men, like women, want to look and feel sexy in their intimate wear. Sam Baker encouraged men to liberate themselves from the shackles of traditional social acceptance and embrace their inner feelings and desires. We continue to promote that joyous and liberating ideology."},{"Name":"Manstore","id":"Manstore","Website":"https://www.manstore.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_1a6ffc20c9464f86b7f2e7d9a3e85bb3~mv2.png","MensUnderwearUrl":"https://www.manstore.com/en/underwear","AboutUrl":"https://www.manstore.com/en/about-manstore","description":"Manstore broadened the narrow horizon of “men's underwear” a long time ago. Even the word “underwear” causes a tired smile with the customers and sellers of the extravagant collection. The word “outerwear” might just be accepted, but “provocative outfit” is certainly the best explanation."},{"Name":"Marco Marco","id":"Marco-Marco","Website":"https://marcomarcounderwear.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_8bbc1c3bf9314ade8d34a32b00257b97~mv2.png","MensUnderwearUrl":"https://marcomarcounderwear.com/collections/mens-underwear","AboutUrl":"https://marcomarcounderwear.com/pages/mens-underwear-stores","description":"Find Marco Marco Mens Underwear and Apparel in these select locations."},{"Name":"Marks & Spencer","id":"Marks-Spencer","Website":"https://www.marksandspencer.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_4d7c9e3b2a3440349e2550706a65828d~mv2.png","MensUnderwearUrl":"https://www.marksandspencer.com/l/men/mens-underwear#intid=gnav_men_socks%20%26%20underwear_underwear","AboutUrl":"https://www.marksandspencer.com/c/style-and-living/the-mands-archive","description":"Step back in time and discover the M&S story from past to present. Take a tasty tour around our top food innovations across the years; get the lowdown on our activewear through the ages; discover decades of M&S lingerie and more…"},{"Name":"Matman","id":"Matman","Website":"https://www.matmanedge.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_e081cfa740784b02bb975daacae92445~mv2.png","MensUnderwearUrl":"https://www.matmanedge.com/collections/all","AboutUrl":"https://www.matmanedge.com/pages/contact-us","description":"Matman's Lycra Briefs are a staple of versatility Ideal undergarment for singlets Close comfortable fit Stretchy, moisture wicking Lycra Anti-order technology to help maintain freshness Comfort and style like you won't find elsewhere"},{"Name":"McDavid","id":"McDavid","Website":"https://www.mcdavidusa.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_11905817a6704be888bb6ca1b3c26bb3~mv2.png","MensUnderwearUrl":"https://www.mcdavidusa.com/collections/protection/padded-bottoms","AboutUrl":"https://www.mcdavidusa.com/pages/about-mcdavid","description":"McDavid Inc. designs and markets sports medicine, sports protection, and performance apparel for active people and athletes. We are relentless in our pursuit of preventing injuries and enhancing performance. Our story began in 1969 when Dr. Robert F. McDavid Jr., the company's namesake and founder emeritus, created the first widely used protective knee brace for football. After a period of grass-roots growth, a company incorporated as McDavid Knee Guard Inc. in 1980."},{"Name":"Mckillop","id":"Mckillop","Website":"https://www.mckstore.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_2c2675eba65d4de387d1c6cb8aa930fc~mv2.png","MensUnderwearUrl":"https://www.mckstore.com/cat/mck/mck-all/underwear-collections","AboutUrl":"https://www.mckstore.com/about-mck","description":"Mckillop takes a different approach to clothing. We are a small team of sewing professionals that are lead by Owner/Designer Ryan Mckillop and his approach to business is different because it is about the people first. Our Clients and our Staff are our first priority. We are also not a brand, we are a factory where we can empower our team participate in all facets of the business. Our goal is to change lives, have fun, and we measure our success by how many jobs we are able to provide."},{"Name":"MeUndies","id":"MeUndies","Website":"https://www.meundies.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_e95779350a36463b90933229f0e2414e~mv2.png","MensUnderwearUrl":"https://www.meundies.com/t/men","AboutUrl":"https://www.meundies.com/about","description":"At MeUndies, we believe everyone should feel free to be the truest version of themselves—despite what societal “norms” dictate. We launched our cause marketing platform MeUndies Gives as our personal commitment to fight conformity and promote acceptance and change. Through MeUndies Gives, we partner with organizations that help lift systemic barriers through open conversations and creativity. Simply by shopping at MeUndies, you help us open the door for all to live equally, authentically, and without apology."},{"Name":"Michael Kors","id":"Michael-Kors","Website":"https://www.michaelkors.ca","LogoUrl":"https://static.wixstatic.com/media/dcf82b_f557fa9b1b2342908d7fbe28df377081~mv2.png","MensUnderwearUrl":"https://www.michaelkors.ca/men/clothing/_/N-2852","AboutUrl":"https://www.michaelkors.ca/info/about-us/s11400064","description":"Michael Kors is a world-renowned, award-winning designer of luxury accessories and ready-to-wear. His namesake company, established in 1981, currently produces a range of products under his signature Michael Kors Collection, MICHAEL Michael Kors and Michael Kors Mens labels. These products include accessories, footwear, watches, jewelry, women’s and men’s ready-to-wear, wearable technology, eyewear and a full line of fragrance products."},{"Name":"Modus Vivendi","id":"Modus-Vivendi","Website":"https://e-modusvivendi.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_fe131a0a9b0649bb9d4755f35772fb4b~mv2.jpg","MensUnderwearUrl":"https://e-modusvivendi.com/underwear","AboutUrl":"https://e-modusvivendi.com/about-us","description":"The story of Modus Vivendi is the culmination of a Dream. A Dream to go beyond limited choices. Based in Thessaloniki, Greece, Modus Vivendi launched in December 1989 by the Greek Designer Christos Bimpitsos as a more tailored approach to exclusive men's underwear, swimwear, activewear & loungewear."}]},{"GroupName":"N","GroupID":"Brands_N","Brands":[{"Name":"Nasty Pig","id":"Nasty-Pig","Website":"https://store.nastypig.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_3099b73542db4fb8bebb5fb9b316d694~mv2.png","MensUnderwearUrl":"https://store.nastypig.com/collections/underwear","AboutUrl":"https://store.nastypig.com/pages/history","description":"Nasty Pig is many things. For starters, we're a trailblazing brand that makes hot clothes that get you laid. But we're also an art project, a love story, and an expression of the Great American Dream. We're innovators who have created unique and trendsetting products for over 20 years. We're 100% a product of Downtown NYC, and we're worldwide. We're as influenced by hip-hop culture as we are by gay culture. We're two guys - Frederick Kearney and David Lauterstein - who founded a company and found a life together. And we're the team they built to realize their vision. We're in our third decade of kicking ass, and while we're more popular than ever, very few people know our whole story. So sit back, relax, and enjoy the ride."},{"Name":"Nautica","id":"Nautica","Website":"https://www.nautica.com/","LogoUrl":"https://static.wixstatic.com/media/dcf82b_7fc5357774d84fe496bf176cd5ec0210~mv2.png","MensUnderwearUrl":"https://www.nautica.com/mens-underwear-sleepwear","AboutUrl":"https://www.nautica.com/120519-about-us.html","description":"Our story starts in 1983. Founder and designer, David Chu, had one clear vision: bring the inspiration of the sea to everyday style across the world. Starting with only six outerwear styles. he grew Nautica into a renowned global lifestyle brand with over 35 categories in more than 65 countries. Today, we continue to be defined by our original vision of reimagined nautical style. With a refreshed take on our heritage, we create high-quality fashion that delivers versatility and comfort."},{"Name":"New Balance","id":"New-Balance","Website":"https://www.newbalance.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_c67b563a9ab6475d80ea902655e84e98~mv2.png","MensUnderwearUrl":"https://www.newbalance.com/women/accessories/Active-Underwear","AboutUrl":"https://www.newbalance.com/about-new-balance-content-assets/inside-nb-overview.html","description":"While there’s no reason you couldn’t wear these (or Hunsinger’s Under Armour pair) for working out, the fact that both men told us these are their everyday underwear led us to include them here and not with the best performance underwear further down on this list. Breslin calls his favorite New Balance pair the “perfect boxer brief that makes me feel athletic even when I’m doing absolutely nothing.” Describing the feel as “tight and smooth,” he adds that there’s also “this little pocket that is so unnecessary but makes me feel like a badass at all times. Never know what I’m going to hide!”"},{"Name":"Nice Laundry","id":"Nice-Laundry","Website":"https://www.nicelaundry.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_70deac21e85f4550887ed3c244e78352~mv2.png","MensUnderwearUrl":"https://www.nicelaundry.com/pages/underwear","AboutUrl":"https://www.nicelaundry.com/pages/accessibility","description":"Featuring anti-ride up leg bands, horizontal fly, and our custom blend of Siro-spun Micromodal®. It's supportive, odor-resistant, and supremely breathable."},{"Name":"NIKE","id":"NIKE","Website":"https://www.nike.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_8895194096db459fad86a9d6a916632b~mv2.png","MensUnderwearUrl":"https://www.nike.com/w/mens-socks-7ny3qznik1","AboutUrl":"https://about.nike.com","description":"Our mission is what drives us to do everything possible to expand human potential. We do that by creating groundbreaking sport innovations, by making our products more sustainably, by building a creative and diverse global team and by making a positive impact in communities where we live and work. Based in Beaverton, Oregon, NIKE, Inc. includes the Nike, Converse, and Jordan brands."}]},{"GroupName":"O","GroupID":"Brands_O","Brands":[{"Name":"Obviously Apparel","id":"Obviously-Apparel","Website":"https://obviouslyapparel.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_256d4d91b0a24bb59587a624cd192b9d~mv2.png","MensUnderwearUrl":"https://obviouslyapparel.com/collections/freeman-underwear","AboutUrl":"https://obviouslyapparel.com/pages/contact-us","description":"Years ago, frustrated with a seemingly endless choice of more of the same styles of underwear, Obviously Apparel set out to disrupt the underwear market with our signature anatomical pouch. Along the way we developed underwear made from nothing but the finest natural fabrics to become a world renowned premium men's underwear brand."},{"Name":"OlafBenz","id":"OlafBenz","Website":"https://www.olafbenz-shop.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_1dfc31950a7f4b0692e5a60dbb5f767e~mv2.png","MensUnderwearUrl":"https://www.olafbenz-shop.com/en/underwear","AboutUrl":"https://www.olafbenz-shop.com/en/service/about","description":"OlafBenz-Shop.com is an online shop with a large assortment of underwear from Olaf Benz. OlafBenz-Shop.com is part of Piazza Intimi Bodyfashion. Piazza Intimi Bodyfashion is official dealer of the brand Olaf Benz. The articles of Olaf Benz are purchased directly from Premium Bodywear AG, manufacturer and licensee of the brand Olaf Benz. Olaf Benz® is a licensed brand from Frank-Karl Markert (Großostheim, Germany)."},{"Name":"Original Penguin","id":"Original-Penguin","Website":"https://www.originalpenguin.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_1132b514ba6f48acb9d18a9f7709844f~mv2.png","MensUnderwearUrl":"https://www.originalpenguin.com/collections/underwear","AboutUrl":"https://www.originalpenguin.com/pages/about-us","description":"In 1955, an ambitious salesman named Abbot Pederson traveled to NYC on a sales trip for the Munsingwear brand. With time to kill before a flight home, he decided to pop into a local bar for a few whiskeys. Little did he know, his next steps would stumble into history."},{"Name":"Orlebar Brown","id":"Orlebar-Brown","Website":"https://www.orlebarbrown.com","LogoUrl":"https://static.wixstatic.com/shapes/dcf82b_af2d54f9b7ba4f949fea24ff2582539d.svg","MensUnderwearUrl":"https://www.orlebarbrown.com/us/men/underwear","AboutUrl":"https://www.orlebarbrown.com/us/about.html","description":"Based in London, Orlebar Brown launched in March 2007 as a more tailored approach to men's beach and swim shorts. Not so much a swim short but a 'short you can swim in', offering something you can wear on the beach, by the pool and then smart enough to go and have a drink or lunch."},{"Name":"Oscalito ","id":"Oscalito ","Website":"https://www.oscalito.us","LogoUrl":"https://static.wixstatic.com/media/dcf82b_2dd683d6457f4189ae1f2b57b0a4a6f3~mv2.jpg","MensUnderwearUrl":"https://www.oscalito.us/product-category/mens/boxers","AboutUrl":"https://www.oscalito.us/about-us","description":"In Turin in the early 1930s, Osvaldo and Lino Casalini began producing cotton and wool fabrics and in 1936, they launched  their brand.  The name is simple, derived from their own names and the name of their beloved city. Osvaldo Casalini Lino Torino……. OsCaLiTo……Oscalito."},{"Name":"O'NEILL","id":"ONEILL","Website":"https://eu.oneill.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_398a4cd7bd5a4e7ea5dd326ee141fb58~mv2.png","MensUnderwearUrl":"https://eu.oneill.com/collections/men?_=pf&pf_pt_product_category=Shorts","AboutUrl":"https://careers.oneill.com/en/?_gl=1*1hwrbox*_ga*MTAwMDc5NzIwMC4xNjE2MDU3OTk3*_ga_M4NYMGD5X9*MTYxNjA1Nzk5Ni4xLjEuMTYxNjA1ODA1OS4w","description":"O'Neill began as a small surf shop in 1952 - right at the golden beginning before you could really say that there was such a thing as a surf culture. It was just something that people did. But it was something that enough people did that you could open up a surf shop and make a living, which is what Jack O'Neill did just across 'The Great Highway' in San Francisco, only a sand dune away from his favorite surf spot."}]},{"GroupName":"P","GroupID":"Brands_P","Brands":[{"Name":"Paul Smith","id":"Paul-Smith","Website":"https://www.paulsmith.com","LogoUrl":"https://static.wixstatic.com/shapes/dcf82b_9ed7e023d78446ec8a901559a596a5d8.svg","MensUnderwearUrl":"https://www.paulsmith.com/us/mens/underwear-nightwear","AboutUrl":"https://www.paulsmith.com/us/company-history","description":"Paul Smith’s underwear and nightwear collection features a range of mens boxers, boxer briefs and regular briefs - available in multipack as well. So whatever your preference to the boxers or briefs question may be, and whether bold stripes, fun patterns and classic monochrome, we have it covered. We also feature pajamas (known to many as pyjamas) and nightgowns."},{"Name":"Papi","id":"Papi","Website":"https://wearpapi.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_7659cd7ac2cb48f5b0e1700ba9c8598f~mv2.jpg","MensUnderwearUrl":"https://wearpapi.com/collections/all","AboutUrl":"https://wearpapi.com/pages/about-us","description":"A premium lifestyle brand suited for a contemporary man. Papi is influenced by its Hispanic Heritage and inspirations from South Beach's culture."},{"Name":"Party Pants","id":"Party Pants","Website":"https://partypantsusa.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_f62c4ce69ff04efbb071108359de6436~mv2.jpg","MensUnderwearUrl":"https://partypantsusa.com/collections/all-shorts-1","AboutUrl":"https://partypantsusa.com/pages/about-us","description":"At Party Pants, we don't sell awesomely designed premium shorts for every occasion. We sell a lifestyle. A lifestyle where you can live the permanent vacation all year around. A lifestyle where you're a legend everywhere you go. Whether you're sipping piña coladas poolside, hitting that Coachella after party, or cruising to the Bahamas on a yacht, we've got you covered with the ultimate party short. Because life is too short to wear pants."},{"Name":"Patagonia","id":"Patagonia","Website":"https://www.patagonia.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_da7a526b6b3f427e8a58b5b7df340856~mv2.jpg","MensUnderwearUrl":"https://www.patagonia.com/shop/mens-underwear","AboutUrl":"https://www.patagonia.com/actionworks","description":"Patagonia has always had its feet firmly planted in the outdoors. This has played no small part in their success. As a performance apparel and gear manufacturer they are in the top of their field. Patagonia began life as a climbing tool company created by Yvon Chouinard, an avid climber and outdoors enthusiast. It seemed natural to take the innovative approach that Patagonia was taking with their climbing tools and embrace all aspects of climbing and outdoor gear. Patagonia the brand would expand into active outdoor performance clothing geared towards skiers, climbers, hikers, surfers and others who enjoy demanding outdoor activities. Their current line of men's clothing includes jackets, pullovers, shirts, boxer briefs, boardshorts, swimwear and more types of sports underwear and gear. "},{"Name":"Perry Ellis","id":"Perry-Ellis","Website":"https://www.perryellis.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_a094947de3734ca19a2c78d7bd74d94e~mv2.png","MensUnderwearUrl":"https://www.perryellis.com/collections/underwear","AboutUrl":"https://www.perryellis.com/pages/about-us","description":""},{"Name":"PetitQ","id":"PetitQ","Website":"https://world.petit-q.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_ab635391a37b4a8e9abb9b69a4ca83d3~mv2.png","MensUnderwearUrl":"https://world.petit-q.com/collections/best-sellers","AboutUrl":"https://world.petit-q.com/pages/conditions-generale-de-ventes","description":"PetitQ Underwear offers the largest range of men's underwear with briefs and boxer briefs but mainly a lot of erotic underwear like thongs, g-strings, bikinis and jockstraps."},{"Name":"Pikante","id":"Pikante","Website":"https://www.pikanteunderwear.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_61509924b5404f6aaa314a6cae81b151~mv2.jpg","MensUnderwearUrl":"https://www.pikanteunderwear.com/collections/all?sort_by=best-selling","AboutUrl":"https://www.pikanteunderwear.com/pages/about-us","description":"This Pikante collection is all about high visibility-virtually every style features an unexpected detail designed to show a sexy glimpse of skin. There's the Naughty Jockstrap, full-cut in the front like a brief but opens to a bare back, the Army Brief, which features two slits just under the waistband in the front revealing those sexy ab lines, and the Caprice Pikante Boxer with a full open back for a cheeks-out look. Bright candy colors dominate this collection, including cotton candy pink, buttery yellow and sky blue, and in fabrics that run the gamut, from stretch cotton to silky microfiber to shiny metallic and even barely-there mesh."},{"Name":"Players","id":"Players","Website":"https://playersunderwear.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_f349fb545d43408b8b558e04deb74468~mv2.png","MensUnderwearUrl":"https://playersunderwear.com/collections/nylon-products","AboutUrl":"https://playersunderwear.com/pages/contact-us","description":"Founded in 1986, Players underwear is the premiere brand of big and tall mens underwear and nylon underwear. With a mission of creating exceptional products for exceptional men, we’ve become one of the largest big and tall mens underwear brand in America. From boxers shorts to jock straps, athletic shirts to v-neck tees, we offer a full selection of mens big and tall cotton underwear and nylon underwear."},{"Name":"PRIVATE STRUCTURE","id":"PRIVATE-STRUCTURE","Website":"https://www.privatestructure.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_d8da734b801046f690fb5764e1bb2dc9~mv2.png","MensUnderwearUrl":"https://www.privatestructure.com/underwear","AboutUrl":"https://www.privatestructure.com//about-us","description":"PRIVATE STRUCTURE, founded in Kuala Lumpur, the capital of Malaysia in 1999. Through a diverse range of apparel for the urban men and women, PRIVATE STRUCTURE delivers trendy designs that look good and feel good, thus customer satisfaction is of the highest priority here."},{"Name":"PSD","id":"PSD","Website":"https://www.psdunderwear.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_080eecbd4abb4b018efd5c30cb0ba692~mv2.png","MensUnderwearUrl":"https://www.psdunderwear.com/collections/mens-all","AboutUrl":"https://www.psdunderwear.com/pages/about-us","description":"Curt and Ryan Flaitz were broke college kids who could only afford one pair of Calvin Klein underwear to wear out on Friday nights. They discovered an opportunity in the underwear market for designer men’s boxer briefs that were both affordable and comfortable. "},{"Name":"PUMA","id":"PUMA","Website":"https://us.puma.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_ed6ba508fadb42cea60f93847f9f9e2f~mv2.png","MensUnderwearUrl":"https://us.puma.com/en/us/men/accessories/socks-%2B-underwear","AboutUrl":"https://about.puma.com/en/this-is-puma","description":"Every athletic outfit begins with comfortable, high-quality underwear. PUMA men’s boxer briefs are made using high-quality, extra-soft materials. Cut to sit comfortably and stay in place, their elasticated waistbands allow for a full range of movement, while divided, form-fitting seams deliver maximum support. With a variety of classic colors and bold prints to choose from, your underwear will benefit from a serious upgrade. Staying fresh through a workout is important, and PUMA men’s low cut socks are made from ultra-breathable materials and mesh ventilation. Comfortable toe seams and arch support ensure that your focus is on your workout, allowing you to strive towards fitness goals. Take the comfort factor up a step with a pair of PUMA men’s bamboo socks. Constructed from innovative materials derived from bamboo plants, these super soft and ultra-breathable socks have natural odor control to see you through intense training sessions."},{"Name":"PUMP!","id":"PUMP","Website":"https://wearpump.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_83f8b9a224f34dd2ba7bd308a83724ac~mv2.png","MensUnderwearUrl":"https://wearpump.com/category/underwear","AboutUrl":"https://wearpump.com/about-us","description":"Founded in 2009 with brand headquarters in Montreal, Canada, PUMP! Underwear combines a sense of sport with fun fashion trends and daring ideas. Being one of the first to implement splatter and graffiti style painting on their underwear, PUMP! loves to keep their demographic open, hoping to appeal to all audiences with their underwear. Though never acknowledging one specific demographic over another, PUMP! Underwear collections generally display a look revolving around youth, fitness and sport."}]}]}