{"Mens_Underwear_brands":[{"GroupName":"I","GroupID":"Brands_I","Brands":[{"Name":"Insta Slim","id":"Insta-Slim","Website":"https://instaslim.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_5bbc613507fe4a5599707c36588316ee~mv2.jpg","MensUnderwearUrl":"https://instaslim.com/Insta-Slim-Shirts","AboutUrl":"https://instaslim.com/about-us","description":"Shapewear has been very popular with women for years. Shapewear is worn underneath clothing to make the person feel better and look better in what ever they are wearing. Now, it men’s turn to reap the same benefits with a InstaSlim Shirts, a new men’s slimming shirt line. Insta Slim Shirts are available for men who wish to look more toned and fit in their clothing, no diet or exercise required! Insta Slim Shirts can help a man look and feel his best in anything that they wear, eliminating lumps and bumps and helping them to look up to five inches slimmer just by wearing Insta Slim’s mens shapewear underneath their clothing in place of traditional t-shirts or tank tops."},{"Name":"International Jock","id":"International-Jock","Website":"http://www.internationaljock.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_be74ad141865426192f53f9625911d35~mv2.jpg","MensUnderwearUrl":"http://www.internationaljock.com/underwear.html","AboutUrl":"http://www.internationaljock.com/aboutus.html","description":"For more than 19 years, International Jock has established itself as the premier online destination for men's underwear, swimwear, sportswear and apparel. Since our launch in 2000, we have made it our mission to share our passion for men's underwear and swimwear via an online shopping experience that's convenient, simple and fun."},{"Name":"Intymen","id":"Intymen","Website":"https://www.intymen.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_3cf820e6af3f4213b6799897373740c7~mv2.jpg","MensUnderwearUrl":"https://www.intymen.com/collections/underwear","AboutUrl":"https://www.intymen.com/pages/about-us","description":"The Intymen line is a creative collection of traditional and erotic pieces that combine basic fits with modern intimate design elements such as C-Rings, pouch enhancement hammocks and other fun ways of enhancement. Intymen features a large variety of designs from classic underwear briefs to butt-lifting boxer briefs and see-through garments."},{"Name":"IZOD","id":"IZOD","Website":"http://izod.partnerbrands.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_c5390875be664360915d45612b76b16d~mv2.png","MensUnderwearUrl":"https://izod.partnerbrands.com/en/iz-mens-accessories-underwear","AboutUrl":"https://izod.partnerbrands.com/en/about-us","description":"Bold, colorful, and always comfortable, IZOD is known for fresh American style with a weekend state of mind. From popular polos and comfortable pants, to the performance-packed Golf collection, these styles are always ready for a good time (and most are available in regular and Big & Tall sizes). Looking for something for her? The women's assortment is here too."}]},{"GroupName":"J","GroupID":"Brands_J","Brands":[{"Name":"Jack Adams","id":"Jack-Adams","Website":"https://www.jackadamsusa.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_31941fbe44a74b0d9ce4314d7da93e6c~mv2.png","MensUnderwearUrl":"https://www.jackadamsusa.com/underwear","AboutUrl":"https://www.jackadamsusa.com/about-us","description":"At Jack Adams, we offer the modern man high-quality men’s underwear to fit the needs of all of our customers. Whether you’re looking for a bikini fit or a boxer brief, we’ve got the underwear for you. Each of our products have been crafted to be comfortable, breathable, and supportive to provide you with a great everyday fit. For a no-line look and increased mobility, shop our thongs and bikini briefs; for a great moisture-wicking fitness underwear, browse our supportive trunks. For more information on our high-quality men’s underwear, contact us now using our chat feature, and a member of the Jack Adams team will be happy to provide you with assistance."},{"Name":"Jockey","id":"Jockey","Website":"https://www.jockey.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_c1c2b82127b044428f22347914b5beb2~mv2.png","MensUnderwearUrl":"https://www.jockey.com/catalog/men/underwear/all","AboutUrl":"https://www.jockey.com/ourcompany/index","description":"Founded in 1876, born and headquartered in the USA, Jockey International, Inc. is the Original American underwear brand. Jockey is a third-generation family-owned company, headquartered between Chicago and Milwaukee in Kenosha, Wisconsin. The company employs more than 1,600 associates around the world with additional operations in Canada, Germany, Hong Kong, New York, and North Carolina. JOCKEY is a registered trademark in over 120 countries."},{"Name":"Joe Snyder","id":"Joe-Snyder","Website":"https://joe-snyder.us","LogoUrl":"https://static.wixstatic.com/media/dcf82b_c66f3c7da4aa4f919ed208ae2785ab74~mv2.png","MensUnderwearUrl":"https://joe-snyder.us/new-joe-snyder","AboutUrl":"https://joe-snyder.us/about","description":"Malebasics.com was founded in 2003 out of a need to provide men the perfect outlet for purchasing the types of underwear they prefer. From sportswear, to thongs, to sexy briefs and swimwear; we wanted every choice a man could want under one site. Malebasics.com became a reality and we've been satisfying our clients underwear needs ever since. We offer a complete line of swimwear, sportswear and intimate apparel, for every man. After all, it's not just the ladies that want to look good in their underwear. We at Malebasics.com, understand that men want to look sexy and confident in their underwear, and by offering a solid selection, we ensure that they can do just that. From the comfortable boxer-briefs, to the form hugging thong or g-string; men have an array of choices to dress for any occasion."},{"Name":"Joe's Jeans","id":"Joes-Jeans","Website":"https://www.joesjeans.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_6653d099b28f49be9d5957af4f112e08~mv2.png","MensUnderwearUrl":"https://www.joesjeans.com/collections/men-denim-fit-shorts","AboutUrl":"https://www.joesjeans.com/pages/about-us","description":"Founded in 2001 by Creative Director Joe Dahan, Joe's redefines everyday style with its inherently LA sensibility and distinctive rock + roll point-of-view. With an emphasis on offering the perfect fit for everybody, the brand takes a revolutionary approach to denim and sophisticated classics, incorporating the very latest in technology to offer product that is beautiful, innovative, and fits flawlessly."},{"Name":"JOR UNDERWEAR","id":"JOR-UNDERWEAR","Website":"https://jorunderwear.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_f1b583a7eb2e4b17ba409f4213b7df3d~mv2.png","MensUnderwearUrl":"https://jorunderwear.com/collections/mens-underwear","AboutUrl":"https://jorunderwear.com/pages/contact-us","description":"JOR Underwear is the sexiest and hottest brand for men brought from South America, with that Latin flavor we all love, full of vivid and vibrant colors, patterns, fabrics, and textures, it offers a wide collection of Briefs, Boxer, Bikinis, Swimwear, Thongs, and Jockstraps, providing a great variety for activewear and sportswear garments as well. If you need high quality and comfort JOR is the brand you’ve been looking for."},{"Name":"J.Crew","id":"J-Crew","Website":"https://www.jcrew.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_b6cd84c0d317405fa9bb8b9cbc9b82ab~mv2.jpg","MensUnderwearUrl":"https://www.jcrew.com/cn/c/mens_category/underwear_and_boxers","AboutUrl":"https://www.jcrew.com/cn/aboutus/jcrew.jsp","description":"CLASSICS, WITH A TWIST, AND STYLE YOU CAN TRUST We make timeless clothes that last a lifetime…then pair them with of-the-moment styles season after season, decade after decade. We think that distinct heritage pairs perfectly with modern design and fabric technology. We believe in feel-good color… Even if black or navy makes you feel best, we’re here for that. We’re the experts in signature categories: cashmere, coats, blazers, pants—and we also collaborate with the coolest brands out there because we know that creativity is contagious. "}]},{"GroupName":"K","GroupID":"Brands_K","Brands":[{"Name":"KVRT STVFF","id":"KVRT-STVFF","Website":"https://www.kvrtstvff.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_4f4afb01f60d4e16ae6e1581d95aa9cf~mv2.png","MensUnderwearUrl":"https://www.kvrtstvff.com/collections/underwear","AboutUrl":"https://www.kvrtstvff.com/collections/underwear","description":"KVRT STVFF FIRST BROKE A SWEAT IN 2018, INSPIRED BY AND DESIGNED FOR ANYONE WHO FEELS CONFIDENT IN THEIR OWN SKIN. HIGH-END. ALL OUR GARMENTS ARE DESIGNED AND PROTOTYPED IN THE KVRT STVDIO, LOCATED IN BARCELONA, AND CAREFULLY MADE TO LUXURY-LEVEL QUALITY STANDARDS."}]},{"GroupName":"L","GroupID":"Brands_L","Brands":[{"Name":"Lacoste","id":"Lacoste","Website":"https://www.lacoste.com","LogoUrl":"https://static.wixstatic.com/shapes/dcf82b_046eff72efdb41728d97f2f9b0b6b7d5.svg","MensUnderwearUrl":"https://www.lacoste.com/us/lacoste/men/clothing/underwear","AboutUrl":"https://corporate.lacoste.com","description":"Founded by French tennis legend René Lacoste, four-time international champion and the word’s best player in 1926-1927, the Lacoste brand draws inspiration from sporting values of high standards, fair play and daring. We pass down these values through the generations and cultivate elegance as a way of being and inventing one’s life."},{"Name":"LASC","id":"LASC","Website":"https://www.shoplasc.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_71f453426a2d4fce94942bc2bac6c548~mv2.jpg","MensUnderwearUrl":"https://www.shoplasc.com/lasc/underwear.html","AboutUrl":"https://www.shoplasc.com/aboutus.html","description":"In 1983, as Los Angeles was preparing to host the 1984 Olympic games, Mike McGinley and Don Zuidema opened a small retail store in West Hollywood, California, selling men's skin care products. Before long, they had added Olympic-themed t-shirts and other sportswear items to their product offerings. Mike was a former college swimmer and Masters swimmer and soon Mike and Don were manufacturing their own Los Angeles Sporting Club (LASC) swimwear based upon the styles and fits that Mike and his team mates preferred. These swimwear designs were an immediate hit and soon LASC's store was THE place for men to visit in Southern California when looking for fashionable swimwear."},{"Name":"LA PERLA","id":"LAPERLA","Website":"https://us.laperla.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_df1c14e0377b4751bd459d1785732adc~mv2.png","MensUnderwearUrl":"https://us.laperla.com/lingerie","AboutUrl":"https://us.laperla.com/our-heritage","description":"In 1954 Ada Masotti, an Italian woman full of talent and courage, began the journey towards her dream: creating an atelier of corsetry in the name of the best Italian tradition. "},{"Name":"Leonisa","id":"Leonisa","Website":"https://www.leonisa.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_55fc00a0bd9843369727d5edd7a32613~mv2.png","MensUnderwearUrl":"https://www.leonisa.com/en/mens-underwear/underwear-for-men-and-male-underpants","AboutUrl":"https://www.leonisa.com/en/aboutus","description":"Love for what we do, respect for our customers, corporate social responsibility & consideration for the environment: This is Leonisa. In every production plant, every workshop, every distribution center, every company office – employees give it their ALL so that products exceed your expectations."},{"Name":"Levi's®","id":"Levis","Website":"https://www.levi.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_403572ba77d7413f91da1ea3c2c1ac0f~mv2.png","MensUnderwearUrl":"https://www.levi.com/US/en_US/underwear-socks/men/c/levi_underwear_socks_men","AboutUrl":"https://www.levi.com/US/en_US/features/about-us","description":"In 1852, Levi Strauss, an immigrant from Bavaria, opened a dry goods company in San Francisco at the height of the California Gold Rush. While he was working, he recognized a need among hardworking people: clothes built to endure anything. He and tailor Jacob Davis combined copper rivet reinforcements with tough denim, leading to the first manufactured waist overalls in 1873. Today, we call them 'blue jeans.'"},{"Name":"Life is Good","id":"Life-is-Good","Website":"https://www.lifeisgood.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_7565918ec74f4f0da46babf0eac55c10~mv2.png","MensUnderwearUrl":"https://www.lifeisgood.com/search?q=underwear","AboutUrl":"https://www.lifeisgood.com/contact-us","description":"These affordable boxer briefs come recommended by Sterling Doyle, a senior sales associate at upmarket men’s haberdasher Drake’s, who told us he has come across far pricier pairs that aren’t as good."},{"Name":"Lucky Brand","id":"Lucky-Brand","Website":"https://www.luckybrand.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_decc8f34e6164d43923caf74d478deac~mv2.png","MensUnderwearUrl":"https://www.luckybrand.com/men/clothing","AboutUrl":"https://www.luckybrand.com/a-very-lucky-history/our-story.html","description":"Staying true to the rich heritage — and authentic, all-American spirit — of denim, Lucky Brand began crafting great-fitting, vintage-inspired jeans in Los Angeles in 1990. We gave them their distinctively Lucky look by literally putting them through the wringer — ripping, fraying, sanding, patching and washing by hand — to give them true character and soul. Then, we added authentic hardware, personalized touches and playful details, and an American legend was born."},{"Name":"lululemon","id":"lululemon","Website":"https://shop.lululemon.com","LogoUrl":"https://static.wixstatic.com/media/dcf82b_f3a9bb246c264cbaabfc70c09fa573d3~mv2.png","MensUnderwearUrl":"https://shop.lululemon.com/c/men-underwear","AboutUrl":"https://info.lululemon.com/about/our-story","description":"Founded by Chip Wilson in Vancouver, Canada in 1998, lululemon is a yoga-inspired, technical athletic apparel company for women and men. What started as a design studio by day and yoga studio by night soon became a standalone store in November of 2000 on West 4th Avenue in Vancouver’s Kitsilano neighbourhood."}]}]}